run/crossFlow/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1000;

boundaryField
{
    interconnectBottom
    {
        type            zeroGradient;    
    }
    interconnectBottomSides
    {
        type            zeroGradient;
    }
    airInlet
    {
        type            fixedValue;
        value           $internalField;
    }
    airOutlet
    {
        type            zeroGradient;
    }
    airSides
    {
        type            zeroGradient;
    }
    cathodeSides
    {
        type            zeroGradient;
    }    
    cflSides
    {
        type            zeroGradient;
    }        
    electrolyteSides
    {
        type            zeroGradient;
    }
    aflSides
    {
        type            zeroGradient;
    } 
    anodeSides
    {
        type            zeroGradient;
    }         
    fuelInlet
    {
        type            fixedValue;
        value           $internalField;
    }
    fuelOutlet
    {
        type            zeroGradient;
    }
    fuelSides
    {
        type            zeroGradient;
    }    
    interconnectTop
    {
        type            zeroGradient;    
    }
    interconnectTopSides
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
