run/crossFlow/0/air/rho
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";
    
    class           volScalarField;
    object          rho;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0.3516;

boundaryField
{

    airInlet
    {
        type            fixedValue;
        value           $internalField;
    }

    airOutlet
    {
        type            zeroGradient;
    }

    airSides
    {
        type            zeroGradient;
    }

    cathodeSides
    {
        type            zeroGradient;
    }

    cflSides
    {
        type            zeroGradient;
    }

    air_to_interconnect0
    {
        type            zeroGradient;
    }

    air_to_electrolyte //cathode
    {
        //type            fixedValue;
        //value           $internalField;
        type            zeroGradient;
    }
      
}


// ************************************************************************* //
