run/crossFlow/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 0;

boundaryField
{
    interconnectBottom
    {
        type         zeroGradient;
    }
    interconnectBottomSides
    {
        type         zeroGradient;
    }
    airInlet
    {
        type         fixedValue;
        //value        uniform 0.0692;
        value        uniform 1e-15;    //disallow outward diffusion at inlet
                                       // value 0 causes harmonic averaging FPE
    }
    airOutlet
    {
        type         zeroGradient;
    }
    cathodeSides
    {
        type         zeroGradient;
    }
    cflSides
    {
        type         zeroGradient;
    }
    electrolyteSides
    {
        type         zeroGradient;
    }
    aflSides
    {
        type         zeroGradient;
    }
    anodeSides
    {
        type         zeroGradient;
    }
    fuelInlet
    {
        type         fixedValue;
        //value        uniform 0.432;
        value        uniform 1e-15;    //disallow outward diffusion at inlet
                                       // value 0 causes harmonic averaging FPE
    }
    fuelOutlet
    {
        type         zeroGradient;
    }
    interconnectTopSides
    {
        type         zeroGradient;
    }
    interconnectTop
    {
        type         zeroGradient;
    }
}


// ************************************************************************* //
