run/crossFlow/constant/air/porousZones
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          porousZones;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    cathode
    {
        coordinateSystem
        {
            e1        (1 0 0);
            e2        (0 0 1); 
        }

        porosity    0.5;

        Cp          Cp [0 2 -2 -1 0 0 0]    750;
        k           k  [1 1 -3 -1 0 0 0]    3.0;

        Darcy
        {
            d         d [0 -2 0 0 0 0 0] (1e12 1e12 1e12);
            f         f [0 -1 0 0 0 0 0] (0 0 0);
        }

        diffusivity
        {
            //type        fixedDiffusivity;
            //diff0       diff0 [0 2 -1 0 0 0 0]  2.9864e-5;
            // ------------------------------------------ //
            type        porousFSG;
            Tname       T;
            pName       p;
            speciesA    O2;     // diffusing species
            speciesB    N2;     // background species
            porosity    0.5;
            tortuosity  3.0;
            dPore       dPore [0 1 0 0 0 0 0] 8e-06;   // pore size
            doBinary    false;
        }
    }

    cfl
    {
        coordinateSystem
        {
            e1        (1 0 0);
            e2        (0 0 1); 
        }

        porosity    0.25;

        Cp          Cp [0 2 -2 -1 0 0 0]    750;
        k           k  [1 1 -3 -1 0 0 0]    3.0;

        Darcy
        {
            d         d [0 -2 0 0 0 0 0] (1e12 1e12 1e12);
            f         f [0 -1 0 0 0 0 0] (0 0 0);
        }

        diffusivity
        {
            //type        fixedDiffusivity;
            //diff0       diff0 [0 2 -1 0 0 0 0]  1.0540e-5;
            // ------------------------------------------ //
            type        porousFSG;
            Tname       T;
            pName       p;
            speciesA    O2;     // diffusing species
            speciesB    N2;     // background species
            porosity    0.25;
            tortuosity  3.0;
            dPore       dPore [0 1 0 0 0 0 0] 1.111111e-07;   // cfl pore size
            doBinary    false;
        }
    }
)
// ************************************************************************* //
