run/crossFlow/constant/electrolyte/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.001";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 0;

boundaryField
{
    electrolyteSides
    {
        type            zeroGradient;
    }
    electrolyte_to_fuel
    {
        type            calculated;
        value           uniform 0;
    }
    electrolyte_to_air
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
